# Homebrew Completions
tap 'homebrew/completions'

# Git stuff
brew 'git'
brew 'git-flow-avh'
brew 'hub'

# GNU Core Utilities
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'

# Productivity
brew 'psgrep'
brew 'vim'

# XQuartz
cask 'xquartz'

# Web
cask 'google-chrome'
cask 'skype'

# Developer tools
cask 'sublime-text3'
cask 'diffmerge'

# Media
cask 'music-manager'
cask 'vlc'
cask 'spotify'

# Cloud Storage
cask 'dropbox'
cask 'google-drive'
